//!هذا درس من دورة فلاتر ل حسن فليح بعنوان body
//!الان في جميع الدروس القادمة سوف نجعل ملف خاص للدالة main
//!نستدعي بداخلها الدالة رن اب ثم سوف نمرر بداخل هذي الدالة اي درس نشرحه

import 'package:flutter/material.dart';

//!هنا انشأنا كلاس اسمه لسن ون كلاس اعتيادي ليس له علاقة بالويدجت
//!لكن بمجرد اننا نجعله يرث من كلاس استيت لس ويدجت
//!فانه يصبح نوعه استيت لس ويدجت وايضا نوعه ويدجت
//!ليسن ون صار من نوع استيت لس ويدجت اي ويدجت لكن بدون استيت
//!ويجب ان نعمل اوفررايد للدالة بيلد
//!وهي المسؤولة عن رسم المحتويات بداخل التطبيق شرحناه في الدرس السابق
//هنا جعلناها ترجع تكست
//وهو اوبجكت من نوع ويدجت ومررنا له استرينق وهذا ابسط حاجة ممكن نعملها
//الان اذا عملنا تشغيل للبرنامج سوف يعطينا خطأ لانه لابد نجعله بداخل الويدجت
//MaterialApp
//ثم داخل الماتيريال اب نمرر له المتغير النيمد اوبشنال هوم ثم نمرر للهوم
//الويدجت تكست
//اذا ذهبنا لمركز الاكواد عند المتغير home
//سوف نلاحظ انه معرف بهذا الشكل final Widget? home;
//اي ان قيمته اما ويدجت اي نوع ويدجت او null
//الان لحد الان ليس لدينا صفحة
//الان الماتيريال اب مهدت لبناء صفحة لكن الصفحة نبنيها باستخدام الويدجت Scaffold
//نمرر هذا الويدجت للمتغير هوم الان السكافولد يعطينا صفحة واحدة كاملة
//لو تركنا السكافولد بدون ان نمرر له شي لن يعطينا اي خطأ وذلك لان باراميترات
//الكونستركتر اسكافولد كلها عبارة عن نيمد اوبشنال
//سوف نمرر للاسكافولد المتغير بودي وسوف نمرر له ويدجت تكست
//!Wrap or Wrapping تعني احاطة الشي
//لكي نجعل التكست اللي مررناه للبودي في منتصف الصفحة فاننا نعمل له احاطة Wrapping
//بالويدجت سنتر ولكي نعمل هذا بسرعة فاننا نحدد بالماوس على كلمة Text
//!ثم سوف يظهر لنا في الطرف لمبة صفراء نضغط عليها ونختار Wrap with Center
//بالتالي يبح الكود تلقائيا بهذا الشكل Center(child: Text('Hello World'))
//!وبهذي الطرقة نستطيع احاطة اي ويدجت بويدجت اخرى
//!اما اذا اردت احيطها بودجت غير مذكورة في الويدجت الجاهزة التي عرضها لنا
//! ممكن ان نستخدم Wrap with widget
//!ثم نكتب اسم الويدجت يدويا
//نلاحظ انه يعطينا هنت اي الخط المتعرج الازرق تحت الاكواد هذا لكي يحسن لنا
//كتابة الكود وهو هنا في اكواد الماتيريال اب كلها يعطينا هنت ويقول
// Prefer const with constant constructors
//اي انه مادام اننا عملت تكست والتكست لايتغير لا في وقت الكومبايل ولا وقت الرن تايم
//اذا لماذا لاتجعل نوعه const
//ولانك اضفت للسنتر خاصية واحدة فقط لماذا اذا لاتجعلها كونست
//لما نجعل السنتر كونست وقبلها جعلنا التكست كونست فانه يمسحها من التكست
//ويبقيها فقط للسنتر وبالتالي لما لاتجعل الاسكافولد ايضا كونست وفي الاخير
//اذا اردت الهنت كله يختفي اجل الماتيريال اب كونست
//صار الان كل شي بداخل الماتيريال اب هو كونست فلاداعي لكتابة كونست على
//اي شي بداخل الماتيريال اب طالما جعلنا الماتيريال اب نفسه const

class LessonOne extends StatelessWidget {
  const LessonOne({Key? key}) : super(key: key);
  //هذا في النسخ الحديثة يطلبه الكي المفتاح سوف يتم شرحه في دروس لاحقه

  @override
  Widget build(BuildContext context) {
    // return Text('Hello world!');
    return const MaterialApp(
      //  home: Text('Hello world!'),
      //  home: Scaffold(body: Text('Hello World')),
      home: Scaffold(body: Center(child: Text('Hello World'))),
    );
  }
}
