//!هذا درس من دورة فلاتر ل حسن فليح بعنوان Splitting the App
//!الان في جميع الدروس القادمة سوف نجعل ملف خاص للدالة main
//!نستدعي بداخلها الدالة رن اب ثم سوف نمرر بداخل هذي الدالة اي درس نشرحه
//!الان اذا جزئنا البرنامج الى عدة ملفات فاننا سوف نعمل كل اجزاء البرنامج
//!بنفس الرقم في البداية مع اختلاف الاسماء فقط

import 'package:flutter/material.dart';
import 'package:flutter_application_1/21.test.dart';
//نلاحظ هنا اننا نكتب كثير من الاكواد المكررة هنا مثل اكواد التكست استايل
//ولان البرمجة اساسها الاختصار اذا سوف نعرف متغير في الكلاس وخارج الدالة بيلد
//وسوف ننسخ الاكواد المكررة ونعطيها لهذا المتغير بحيث اننا كلما اردنا كتابة
//نفس هذي الاكواد نستدعي اسم هذا المتغير فقط
//لتنضيم الكود نضع اسم للمتغير يدل على المحتويات
//من الامور الواجب مراعاتها ان نضع نوع المتغير من نوع هذا الكلاس او الويدجت
//او اي نوع ونتجنب قدر الامكان ان نضعه فار var
//الان سوف نتعلم كيف نقسم البرنامج الى عدة ملفات لان البرامج التي نعملها بالفلاتر
// سوف تكون كبيرة ومستحيل تكون كلها في ملف واحد
//لذلك يجب ان نجزء البرنامج الى عدة ملفات ونستدعي كل ملف نحتاجة
//الان عملنا ملف test
//وعملنا ملف ماين خاص لهذا البرنامج وسوف نستورد هذا الملف وملف تست فيه
//!الان سوف نوسع الاختصار بشكل كبير بحيث اننا سوف نقوم ببناء الويدجت Text
//هذي الويدجت بما انها اصلا كلاس اذا في الملف الذي انشأناه test
//فيه كلاس اسمه ماي تكست هذا سوف نبني فيه الويدجت تكست بحيث اننا هنا
// بدل ان نكتب هذي الصيغة التي اختصرناها
/*child: Text(
  'ssss',
  style: s,
  )
*/
//نريد ان نكتبها بلشكل التالي
//child: MyText('ssss',s)
//بحيث اننا استدعينا كونستركترالكلاس ماي تكست الذي عملناه في الملف تست
//ومررنا هنا له باراميترين
//الان الشغل كله راح يكون في الملف تست لكي نعرف محتويات هذا الكلاس
// وماهي الباراميترات وكيف الارجاع منه الى هنا

//الان نلاحظ هنا انه من الافضل ان نقوم بنقل المتغير اس الذي عرفناه في بداية الدرس
//ننقله الى الملف تست لانه اصلا تابع التكست ولكي نرتب الاكواد
//نلاحظ انه حتى بعدما نقلناه الى المفل تست لم يحدث لدينا خطاء وانما استطعنا
//استدعائه هنا عادي وذلك لاننا عملنا له استيراد في الاعلى
//الان يمكننا ان نعمل متغير اخر في الكلاس تست نسميه s2
//سوف ننسخ محتويات المتغير الاول اس ونضعها في اس 2 ونعمل عليها تعديل بسيط
//مثلا نحول اللون الى لون اخر وهنا سوف نعطيه مثلا للاوبجكت الثاني وهكذا
//اصبحت العملية سهلة وبدون اكواد طويلة وهناك في الملف تست صار عندنا كل الاكواد
//التي نريدها للويدجت تكست

class LessonTwo extends StatefulWidget {
  const LessonTwo({Key? key}) : super(key: key);
  //هذا في النسخ الحديثة يطلبه الكي المفتاح سوف يتم شرحه في دروس لاحقه

  @override
  State<StatefulWidget> createState() => _LessonTwoState();
  //ممكن نكتبها بطريقة البلوك العادي
  /*
  State<StatefulWidget> createState(){
    return LessonTwoState();
  } 
  */

}

class _LessonTwoState extends State<LessonTwo> {
  //!هنا عرفنا متغير يختصرلنا كود التكست استايل لاننا سوف نستخدم نفس الكود
  //!في عدة اماكن
  //!لايفضل كتابة اسم ونوع المتغير بهذا الشكل
  //var s = TextStyle(color: Colors.red, fontSize: 30);

  //!الافضل نكتبه هكذا
  //TextStyle textStl = TextStyle(color: Colors.red, fontSize: 30);

  //!لكن هنا في الدورة اختصارا للوقت سوف نستخدم هذي الصيغة
  //TextStyle s = const TextStyle(color: Colors.red, fontSize: 30);
  //!الان نقلنا المتغير اس كله ومحتوياته الى الملف تست حسب الشرح في الاعلى

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: Colors.orange,
        title: const Text(
          'AppBar Title',
          style: TextStyle(color: Colors.black),
        ),
      ),
      body: Container(
          color: Colors.orange[200], //لون الكونتينر

          margin: EdgeInsets.only(top: 8.0),
          padding: EdgeInsets.only(top: 8.0),
          //height: double.infinity,
          child: Row(
            //mainAxisAlignment: MainAxisAlignment.center,
            children: <Widget>[
              Padding(
                padding: EdgeInsets.all(8.0),
                child: MyText('aaaa', s), //هنا انشانا اوبجكت من الكلاس ماي تكست
              ),
              Padding(
                padding: EdgeInsets.all(8.0),
                child: MyText(
                    'ssss', s2), //هنا انشانا اوبجكت ثاني من الكلاس ماي تكست
              )
              //!هذا في الاسفل قبل ما نعمل اختصار للويدجت تكست
              //! كلها في كلاس ماي تكست في الملف تست
              /*
                child: Text(
                  'rrrr',
                  style: s, //!وضعنا المتغير الذي عرفناه في الاعلى لاختصار الكود
                ),
              ),
              Text(
                'ssss',
                style: s, //!وضعنا المتغير الذي عرفناه في الاعلى لاختصار الكود
              )

              */
            ],
          )),
    );
  }
}
