//!هذا درس من دورة فلاتر ل حسن فليح بعنوان Bottom Sheet
//!الان في جميع الدروس القادمة سوف نجعل ملف خاص للدالة main
//!نستدعي بداخلها الدالة رن اب ثم سوف نمرر بداخل هذي الدالة اي درس نشرحه

import 'package:flutter/material.dart';
import 'package:flutter_application_1/24.info.dart';

//!اولا معنى كلمة Context
/*
تعني السياق
سياق الاحداث
مجرى الاحداث
الدليل - الاثبات
القرينة اي الشيئ الذي يستدل به

عبارة عن اوبجكت - نموذج - يحتوي على الحد الادنى من الخصائص
 التي تسمح بتنفيذ مهمة او مجموعة من العمليات

 عبارة عن التأثيرات او الاحداث المتعلقة بحدث او حالة معينة

*/

//!بوتموم شيت هو عبارة عن شيت او قائمة تظهر من الاسفل
//لعمل هذا البوتوم شيت في البداية فاننا سوف نقوم بعمل قص لمحتويات لست فيو دوت بيلدر
//الان هذي المحتويات سوف نضعها بداخل دالة معينة
// اولا سوف ننشى دالة بداخل الكلاس نسميها اي اسم مثلا اكس
//ونلصق محتويات اللست فيو بيلدر التي نسخناها نلصقها في بودي الدالةوسوف يعطينا خطا
//هناك دالة يوفرها لنا فلاتر اسمها showModalBottomSheet(context: null,builder:null)
//هذي الدالة تستقبل باراميترين كونتكست وبيلدر
//هذي الدالة لو عرفتها بداخل الدالة بيلد لكان اعطيتها الكونتكست حق الدالة بيلد
// اللي نوعه بيلد كونتكست Widget build(BuildContext context)
//لكننا عرفناها خارج الدالة بيلد وداخل الكلاس تمام مافي مشكلة سوف اعرف باراميتر
//للدالة اكس التي عرفتها داخل الكلاس وخارج الدالة بيلد ولصقت بداخلها محتويات اللست فيو بيلدر
//وايضا استدعيت بداخلها الدالة شو مودل بوتوم شيت
//هذا الباراميتر الذي سوف اعرفه باراميتر مشابه لباراميتر الدالة بيلد سوف اعطيه اسم
//ctx
//ممكن نعطيه اسم context
//لكن لكي لايتشابه مع الكونتكست حق الدالة بيلد نغيره هنا
//ونوعه بيلد كونتكست void x(BuildContext ctx)
//الان بما ان باراميتر الدالة شومودال بوتوم شيت يطلب تغير نوعه كونتكست اذا نمرر له ctx
//اما بالنسبة للباراميتر بيلدر فهو يستقبل دالة كاملة (){}
//الان يجب ان نعرف متغير بداخل الدالة حق البيلدر من نوع كونتكست سوف نسميه bctx
//الان اللي صار اننا مررنا قيمة للباراميتر كوتكست نوعها كونتكست
//وعرفنا قيمة نوعها كونتكست للدالة التي في البيلد
//يجب ان نعرف ان الكونتكست الذي مررناه ctx
//يختلف عن الكونتكست الذي انشأناه bctx
//وبما اننا اجبرنا ان نعرف قيمة نوعها كونتكست في دالة البيلد
// ونحنا اصلا لن نتعامل معها لذلك سوف نضع مكانها اندر سكور
// showModalBottomSheet(context: ctx, builder: (_){})
//حتى المتغير حق الباراميتر ايتم بيلد التابع للست فيو بيلدر
// لاننا لن نستفيد منه نضع مكانه اندر اسكور
//itemBuilder: (ctx, index) {
//itemBuilder: (_, index) {
//البيلدر حق الدالة شو موديل بوتوم شيت سوف تقوم ببناء ويدجت
// هذا الويدجت سوف يظهر في البوتوم شيت
//الان سوف نضع المحتويات التي نريدها ان تظهر في الريتيرن حق دالة الباراميتر بيلدر
//هذي المحتويات هي محتويات الويدجت ليست فيو بيلدر التي عملنا لها قص من البرنامج
//الان الدالة اكس التي بنينا فيها البوتوم شيت جاهزة
//!طيب متى نستعمل هذي الدالة نستعملها مثلا عن طريق زر
//! وعند الضغط عليه تطلع لنا البوتوم شيت
//الان سوف نعمل فلوتين اكشن بوتون
//الان في الباراميتر اون برسد حق الزر سوف نمرر الدالة اكس بدون اقوس لكن يعطينا خطا
//لان الدالة اكس لديها باراميتر وتحتاج الى تمرير قيمة وتمرير القيمة يحتاج الى اقواس
//اذا سوف اقوم بتنفيذ الدالة اكس وليس تمريرها فقط عن طريق ()=> x()
//هكذا الان قمت بتنفيذ الدالة اكس وبالتالي يحق لي فتح الاقواس
//الدالة اكس تحتاج الى تمرير قيمة نوعها كونتكست اذا سوف امرر لها المتغير كونتكست
//حق الدالة بيلد onPressed: ()=> x(context)
//الان لو ننفذ البرنامج سوف نلاحظ ان الزر ضهر وعند الضغط عليه تظهر البوتوم شيت
//!ممكن اننا نختصر كل هذا الموضوع ولانعمل الدالة اكس وانما ناخذ الدالة
//!شو موديل بوتوم شيت وجميع محتوياتها ونضعها في الباراميتر اون برسد حق الزر
//لكن باستخاد الدالة اكس احسن
//!يوجد نوعين من البوتوم شيت
//!نحنا هنا استخدمنا المودل بوتوم شيت ميزته اذا ضغطنا في اي مكان في الشاشة يختفي
//!النوع الثاني هو البوتوم شيت هذا لايغلق عندما نضغط على الشاشة
//! وانما نبرمج زر لكي يغلق النافذة حق البوتوم شيت
//لتغيير خلفية البوتوم شيت فاننا سوف نغير الويدجت بيدن التي عملناها
// في الليست فيو بيلدر ونبدلها ب كونتينر لان الكونتينر فيه خاصية اللون
//وممكن ان ناخذ اللون ايضا من الثيم عن طريق الدالة
//theme.of.(context).primaryColor
//مكان الباراميتر كونتكست نمرر لها متغير نوعه كونتكست يعني
//اذا كنا داخل الدالة بيلد سوف نمرر لها كونتكست نفسه لانه موجود في الدالة بيلد context
//اما اذا اردنا استخدامها في خلفية البوتوم شيت والبوتوم شيت بنيناه
// في دالة خارج الدالة بيلد اذا نمرر له كونتكست حق الدالة اكس وهو ctx
//theme.of.(ctx).primaryColor

class LessonTwo extends StatefulWidget {
  const LessonTwo({Key? key}) : super(key: key);
  //هذا في النسخ الحديثة يطلبه الكي المفتاح سوف يتم شرحه في دروس لاحقه

  @override
  State<StatefulWidget> createState() => _LessonTwoState();
  //ممكن نكتبها بطريقة البلوك العادي
  /*
  State<StatefulWidget> createState(){
    return LessonTwoState();
  } 
  */

}

class _LessonTwoState extends State<LessonTwo> {
  //!هذي طريقة تعريف ليست اوف اوبجكت

  final List<Info> li = [
    Info(name: 'Hassan1', height: 170, date: DateTime.now()),
    Info(name: 'Hassan2', height: 175, date: DateTime.now()),
    Info(name: 'Hassan3', height: 180, date: DateTime.now()),
    Info(name: 'Hassan4', height: 185, date: DateTime.now()),
    Info(name: 'Hassan5', height: 190, date: DateTime.now()),
    Info(name: 'Hassan6', height: 190, date: DateTime.now()),
    Info(name: 'Hassan7', height: 190, date: DateTime.now()),
  ];

  var b = Colors.black;
  var w = Colors.white;

  //!هذي الدالة سوف نبني بداخلها البوتوم شيت
  void x(BuildContext ctx) {
    //showModalBottomSheet(context: ctx, builder: (bctx){})
    showModalBottomSheet(
        context: ctx,
        builder: (_) {
          return ListView.builder(
              itemCount: li.length, //هذي نعطيها عدد العناصر بداخل اللست
              //itemBuilder: (ctx, index) { سوف نضع اندر سكور مكان المتغير لاننا لن نستفيد منه
              itemBuilder: (_, index) {
                //تقوم ببناء العنصر
                return Padding(
                  //هنا قمنا باحاطة الكارد بودجت بيدن لكي نستفيد من البيدن
                  padding: EdgeInsets.all(4.0),
                  child: Card(
                    color: Colors.deepOrange,
                    shadowColor: Colors.greenAccent, //لون الظل
                    elevation: 100, //مستوى ارتفاع الكارد عن الكونتينر
                    child: Container(
                      //هنا غيرنا البيدن الى كونتينر لكي نغير لون البوتوم شيت
                      color: Colors.yellow[100],
                      padding: const EdgeInsets.all(8.0),
                      child: Column(
                        children: [
                          Row(
                              mainAxisAlignment: MainAxisAlignment.spaceAround,
                              children: [
                                Text(li[index].name,
                                    style: TextStyle(
                                      color: w,
                                      fontSize: 35,
                                    )),
                                Text('${li[index].height}',
                                    style: TextStyle(
                                      color: w,
                                      fontSize: 25,
                                    ))
                              ]),
                          Text('${li[index].date}',
                              style: TextStyle(
                                color: w,
                                fontSize: 25,
                              ))
                        ],
                      ),
                    ),
                  ),
                );
              });
        });
  }

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        //backgroundColor: Colors.orange,
        title: const Text(
          'AppBar Title',
          style: TextStyle(color: Colors.black),
        ),
      ),
      body: Container(
        color: b,
      ),
      floatingActionButton: FloatingActionButton(
          child: Icon(Icons.add), onPressed: () => x(context)),
    );
  }
}
