//!هذا درس من دورة فلاتر ل حسن فليح بعنوان appBar
//!الان في جميع الدروس القادمة سوف نجعل ملف خاص للدالة main
//!نستدعي بداخلها الدالة رن اب ثم سوف نمرر بداخل هذي الدالة اي درس نشرحه

import 'package:flutter/material.dart';

//هذا البرنامج تكملة للبرنامج في الملف رقم 2
//شرحنا حتى البودي home: Scaffold(body: Center(child: Text('Hello World'))),
//الان هنا سوف نشرح الاكواد الجديدة التي سوف نضيفها
//الان سوف نضيف اب بار ضمن الاسكافولد appBar
//نلاحظ ان نوع هذا لاب بار هو برفيرد سايز ودجت final PreferredSizeWidget? appBar
//اي انه يقبل نل او اي شي نوعه PreferredSizeWidget?
//اي انه يقبل قيمة من هذا النوع وسوف نمرر له الويدجت AppBar()
//نلاحظ ان نوع هذا الكلاس هو class AppBar extends StatefulWidget implements PreferredSizeWidget
//نوعه برفيرد سايز ودجت اي نفس النوع اللي يبغاه النيمد باراميتر اب بار
//الان الويدجت اب بار اللي مررناه للمتغير اب بار اذا خليناه فارغ سوف يعطينا خطا
//نلاحظ ان هذا الخطاء لاننا وضعنا الماتيريال اب كله كونستانت
//ولكن كونستركتر الويدجت اب بار ليس كونستانت لذلك يجب ان نلغي الكونت من الماتيريال اب
//وضعنا كونست في الماتيريال اب في الدرس السابق لان كل كونستراكترات الويدجت
//التي بداخل الماتيريال اب هي مبنية اصلا ك كونستانت
//اذا رجعت للاكواد سوف تلاحظ قبل كل كونستراكتر للويدجت مكتوب كونست
//قبل الاسكافولد وقبل السنتر  اما لما اضفنا الاب بار فحقه الكونستركتر ليس كونست
//اذا عملنا هوت ريلود سوف يظهر لنا في البرنامج الاب بار
//وهو عبارة عن المستطيل الازرق اللي في راس الصفحة
//الاب بار مقسم الى ثلاثة اقسام القسم اللي في الطرف الايسر يسمى ليدينق leading
//وفي الوسط التايتل title
//وفي الطرف الايمن يوجد الاكشن actions
//عملنا التايتل ومررنا له ويدجت تكست
//سوف نلاحظ ان النص اللي اضفناه في التايتل جاء ناحية اليسار
//وذلك لانه حجز المساحة كلها لاننا لم نضيف خصائص اخرى
// واذا اضفنا ليدينق او اكشن سوف يروح الى مكانه
//الان اضفنا الليدينق ونوعها ويدجت اي ممكن نضيف لها اي ويدجت ممكن نضيف لها
//ودجت تكست لكن المتعارف عليه في هذا المكان اننا نضيف ودجت ايقونة
//نلاحظ ان الويدجت ايكون لدية باراميتر اجباري واحد هو this.icon,
//هذا الباراميتر نوعه ويستقبل قيم من نوع IconData
//والبقية اختيارية اذا لابد ان نمرر له قيمة لهذا الباراميتر الاجباري
//الباراميتر الاجباري يسمى positional
//نمرر له كارقيومنت كلاس اعتيادي جاهز في فلاتر اسمه Icons
//ونستعرف كمية كبيرة من الايقونات الجاهزة نضيف اي واحد منها
//اذا اخترنا اي ايقونة ثم ذهبنا الى اكوادها سوف نلاحظ انها ترجع نوع IconData
//الان سوف نضيف القسم اكشن ونلاحظ ان نوعها لست اوف ويدجت 
//اي انه ممكن نضيف لسته من الودجت

class LessonOne extends StatelessWidget {
  const LessonOne({Key? key}) : super(key: key);
  //هذا الكي المفتاح سوف يتم شرحه في دروس لاحقه

  @override
  Widget build(BuildContext context) {
    return MaterialApp(
      home: Scaffold(
        body: const Center(child: Text('Hello World')),
        appBar: AppBar(
            title: const Text('Home page'),
            leading: const Icon(Icons.access_alarm_rounded),
            actions: const [
              Icon(Icons.access_alarm_rounded),
              Icon(Icons.access_alarm_rounded),
              Icon(Icons.access_alarm_rounded),
            ]),
      ),
    );
  }
}
