//!هذا درس من دورة فلاتر ل حسن فليح بعنوان Multi Screens
//!في هذا الدرس سوف نتعلم كيفية انشاء تطبيق مكون من عدة صفحات
//!سوف ننشئ عدة ملفات بالرقم 32 وفي كل ملف عبارة عن صفحة من التطبيق
//!وملف مستقل سوف نضع بداخله الشاشة الرئيسية للتطبيق والدالة main()
//!بامكاننا اعتبار اي اسكافولد يمثل صفحة بحد ذاته
//!كل صفحة من التطبيق سوف يتم استدعائها في الملف ماين الخاص بهذا التطبيق

//! هذا ملف Home screen and main()

import 'package:flutter/material.dart';
import 'package:flutter_application_1/32.MultiScreens_1.dart';

import '32.MultiScreens_2.dart';

void main() {
  runApp(const MyApp());
}

class MyApp extends StatelessWidget {
  const MyApp({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return MaterialApp(
      debugShowCheckedModeBanner: false,
      //title: 'Flutter App',
      theme: ThemeData(primaryColor: Colors.blue),
      home: MyHomePage(),
    );
  }
}

//!هنا في هذا الكلاس سوف نستدعي الصفحات الاخرى
//سوف نقوم بعمل زر في هذي الصفحة الرئيسية بحيث انه عند الضغط عليه
// ينقلنا الى صفحة اخرى
//سوف نستخدم الويدجت انك ويل الذي عمله مشابه للزر لانه قابل للضغط عليه InkWell
//يحتوي هذا الويدجت على عدد من الخصائص ومنها الخاصية اون تاب يعني عند الضغط
// onTap:
//هذي الخاصية تريد مننا دالة كاملة عملها مثل عمل اون برسد في الزر
//الدالة هذي ممكن نكتبها بشكل مباشر والافضل ان نكتبها بشكل منفصل داخل الكلاس
// وخارج الدالة بيلد سوف ننشى دالة اسمها selectScreen()
//هذي الدالة سوف نحتاج في البودي تبعها الى النافيقيتر -الموجه- وهو الذي
// سوف ينقلنا الى الصفحات الاخرى وهذا النافقيتر سوف يحتاج الى كونتكست
// اذا لابد ان اجل باراميتر في الدالة من نوع بيلد كونتكست
// ولكي لايتشابه الاسم مع كونتكست الدالة بيلد سوف نسميه سي تي اكس ctx
//!ماهي فائدة الكونتكست context
//! الكونتكست يعطي معلومات عن مكان السكرين او مكانك انت ضمن الويدجت الذي تريد
//!فلكي نتنقل بين السكرين اول حاجة نريد معلومات عن السكرين التي نحنا فيها حاليا
//!لذلك فاننا سوف نمرر المتغير سي تي اكس للنافيقيتر مكان الكونتكست الذي يريده
//الان عند وضع نقطة تظهر لنا عدة دوال اهم دالتين هما دالة البوش والبوب push , pop
//البوش لاضافة صفحات والبوب لحذف الصفحات Navigator.of(ctx).push(route)
//الان دالة البوش تحتاج الى راوت اي توجيه اي الناقل الذي سوف يوجهنا الى الصفحة
//التي نريد لذلك نضيف لها ماتيريال بايج روت
// Navigator.of(ctx).push(MaterialPageRoute(builder: builder))
//الماتيريال بيج روت يحتاج الى بيلدر لكي يبني لنا الصفحة
// لذلك البيلدر يحتاج ان نمرر له دالة كاملة هذي الدالة يتم فيها تعريف الكونتكست
// ولابد ان نفرق بين تمرير الكونتكست مثل المتغير سي تي اكس
// الذي مررناه في النافيقيتر اما هنا في الدالة بيلد نريد تعريف الكونتكست
//نعرف متغير كونتكست ولنسميه اي اسم لكن هنا حاليا لانحتاج اليه
// يعني ان الدالة التي نمررها في البيلدر تحتاج الى باراميتر من نوع كونتكست بيلدر
// ولكننا هنا الان لانريد هذا الكونتكست لذلك سوف نضع بدله اندر اسكور
//الان في بودي دالة البيلدر يجب ان نعمل ريتيرن لشي ماء وهو اكيد الصفحة
//نعمل ريتيرن لاوبجكت من الكلاس Screen1()
//الان بهذي الطريقة فان هذي الدالة متى ما نستدعيها فانها تنقلنا الى السكرين رقم 1
//اذا علمنا هوت ريلود ونقرنا على نص الاينك ول نلاحظ انه ينقلنا الى الصفحة سكرين1
//فلاتر يقوم بعمل زر الرجوع بشكل تلقائي اعلى الصفحة
//الان نحتاج الى عمل اينك ول اخر للصفحةالثانية لكن عندنا ويدجت سنتر
// وفيه شيلدرن واحد فقط استخدمناه للاينك ول الاول
// لذلك حتى نستطيع عمل ويدجت اينك ول اخرى سوف نعمل احاطة للاينك ول بعمود
// حتى نتمكن من اضافة اكثر من اينك ول في لستة التشيلدرن
//الان المفروض انه نعمل دالة اخرى لكي تنقلنا الى الصفحة 2 لكن هذا غير عملي
// كل مرة نريد ان ننتقل الى صفحة اخرى نعمل دالة جديدة لذلك سوف نعدل
// على الدالة سيلكت اسكرين التي عملناها لكي تنقلنا للصفحة الاولى
// وسوف نضيف لها باراميتر ثاني بحيث اننا عندما نستدعيها نمرر لها الكونتكست
// مع رقم الصفحة التي نريد الانتقال اليها وفي بودي الدالة بيلدر المفروض
//اننا نعمل اف شرطية بحيث تتحقق من قيمة الباراميتر الثاني
//بحيث اذا كان رقم 1 تنقلنا للصفحة الاولى واذا كان 2 تنقلنا للصفحة 2 وهكذا
//
//الان اريد اننا بداخل السكرين اتنقل الى سكرين اخرى
// لذلك ننسخ هذي الاكواد ونلصقها ايضا في كلاسات سكرين 1 وسكرين 2
//ننسخ الدالة سيلكت اسكرين وننسخ احد اكواد الويدجت اينك ول ونلصقها في كل كلاس
//طبعا مافي داعي للباراميتر الثاني ولا داعي للاف الشرطيةلان الانتقال سوف يكون
//من سكرين 1 الى سكرين 2 والعكس
//!الان بعد الانتهاء سوف نلاحظ خطأ كارثي سوف يجعل البرنامج يستهلك بطارية الجوال
//!وهو انه لما نكون في سكرين 1 ونضغط قو تو سكرين 2 سوف ينقلنا الى سكرين
//2 وفي سكرين 2 عندما اضغط الزر سوف ينقلنا الى سكرين 1 وهكذا كل مرة
// وفي كل مرة اتنقل نلاحظ انه سوف يضع صفحة فوق الاخرى ولايمسح
// الانتقال السابق يعني لوضغطنا زر الرجوع سوف يعيدنا الى الصفحة السابقة ثم
//مثلا لو انتقلنا من الرئيسية الى 1 ثم الى 2 ثم الى 1 ثم الى 2 ثم
// الى 1 ثم الى 2 فلو ضغطنا زر الرجوع سوف يرجع من 2 الى 1 ثم الى 2 ثم الى 1 ثم
// الى 2 ثم الى 1 ثم الى الرئيسية اي انه يكدس الصفحات بعضها فوق بعض
//!الان اريده عندما ينتقل الى سكرين جديدة يحذف السكرين السابقة
//!ولحل المشكلة هذي ببساطة نستخدم بدل الدالة بوش نستخدم الدالة بوش ريبليسمنت
//! Navigator.of(ctx).pushReplacement(MaterialPageRoute
//فهذي هي فائدة الدالة بوش ريبليس منت بانها تضيف نافذة ولكن تستبدلها مكان النافذة الحالية

class MyHomePage extends StatelessWidget {
  void selectScreen(BuildContext ctx, int n) {
    //Navigator.of(ctx).push(MaterialPageRoute(builder: (_) {
    Navigator.of(ctx).pushReplacement(
      MaterialPageRoute(builder: (_) {
        if (n == 1) return Screen1();
        return Screen2(); //هنا يفهم تلقائيا حتى لو لم نكتب ايلس
      }),
    );
  }

  @override
  Widget build(BuildContext context) {
    return Scaffold(
        appBar: AppBar(
          //backgroundColor: Colors.orange,
          title: const Text(
            'Main Screen',
            style: TextStyle(color: Colors.black),
          ),
        ),
        body: Center(
          child: Column(
            mainAxisAlignment:
                MainAxisAlignment.center, //لجعل العناصر في المنتصف
            children: [
              InkWell(
                child: Text('Go to screen 1', style: TextStyle(fontSize: 35)),
                onTap: () {
                  return selectScreen(context, 1);
                  //الدالة سلكت اسكرين تحتاج ارقيومنت من نوع بيلدر كونتكست
                  // لذلك نمرر لها كونتكست الدالة بيلد
                },
              ),
              InkWell(
                child: Text('Go to screen 2', style: TextStyle(fontSize: 35)),
                onTap: () {
                  return selectScreen(context, 2);
                  //الدالة سلكت اسكرين تحتاج ارقيومنت من نوع بيلدر كونتكست
                  // لذلك نمرر لها كونتكست الدالة بيلد
                },
              ),
            ],
          ),
        ));
  }
}
