//!هذا درس من دورة فلاتر ل حسن فليح بعنوان More about push Replacement Named
//!هذا الملف هو نفسه ممكن ان نعتبره ملف الماين اذا اردنا تنفيذ هذا التطبيق
//!نعدل فقط اسم الملف ونسميه main
//!هذا الملف سوف يكون مرتبط بالسكرين 1 والسكرين 2 والدراور ملفات رقم 38

import 'package:flutter/material.dart';
import '38.Drawer.dart';
import '38.Screen1.dart';
import '38.Screen2.dart';

//هذا الدرس هو نفسه درس الدراور في الملف رقم 35 لكن هنا سوف نعمل عليه تعديل
//وذلك لانه في الدالة سلكت اسكرين عندما نستخدم بوش ريبليس منت نيمد
//Navigator.of(ctx).pushReplacementNamed
//فانه عندما نضغط على قو تو اسكرين 1 او 2 في الدراور فعندما ينقلنا
// الى احد الصفحات فانه يحذف زر العودة اي اننا لانستطيع العودة الى الصفحة الرئيسية
// بسبب استخدامنا بوش ريبليسمنت نيمد فانه يحذف الصفحة التي قبلها
// وبالتالي يفهم فلاتر انه لاداعي للرجوع لان الصفحة اصلا حذفها
// ولو غيرناها واستخدمنا بوش نيمد
// فان زر العودة سوف يكون موجود ولكن زي ماشرحنا في الدروس السابقة
// سوف يعمل تكديس للصفحات واستهلاك للبطارية
//لذلك اذا اردنا المستخدم ان يذهب الى صفحة معينة ونلغى زر الرجوع
// نستخدم بوش ريبليسمنت نيمد
//مثل ان نجعل صفحة تسجيل الدخول ثم اذا انتقل للصفحة بعدها لايرجع اليها ابدا
//اما اذا اردنا زر الرجوع نستخدم بوش نيمد مع هذا الحل
// الحل هو اننا ننسخ اكواد الدراور ونلصقه في كل صفحة
// بحيث اننا اذا استخدمنا بوش ريبليسمنت نيمد واختفى زر الرجوع
// نستطيع العودة الى اي صفحة عن طريق الدراور
//ولكننا سوف نكرر نفس الاكواد حق الدراور في كل صفحة وهذا غير مستحب
// لذلك سوف نعمل ملف مستقل سوف ننشى فيه كلاس سوف نسمية ماي دراور
// ونجعل الدالة بيلد ترجع دراور كامل وسوف نحذف اكواد الدراور من كل الصفحات
// ونستبدلها باستدعاء اوبجكت من كلاس ماي دراور الذي سوق يعطينا دراور كامل
// في اي مكان نريده
// drawer: MyDrawer(),
//ايضا نضيف لملف الدراور نضيف الى لستة التشيلدرن حق اللست فيو التي بداخل الدراور
// نضيف للتشيلدرن عنصر اخر هو ليست تايل اخرى تمثل الصفحة الرئيسية
// حتى تظهر ايضا في الدراور
//ايضا يجب ان نعدل شرط الاف استيتمنت في الدالة سلكت اسكرين في ملف الدراور
//سوف تكون لدينا شرط متداخل اذا كانت ال ان تساوي 0 انتقل للصفحة الرئيسية
// والتي رمزها في الروت هو '/'
//واذا كان ال ان يساوي 1 انتقل لللسكرين1 ورمزها في الروت '/x1'
//واذا كان ال ان يساوي 2 انتقل لللسكرين2 ورمزها في الروت '/x2'
//كل هذا ممكن نسوية ب اف الس استيتمنت او ان لاين استيتمنت كالتالي
// n == 0? '/' : (n == 1)? '/x1' : '/x2',
//

void main() {
  runApp(const MyApp());
}

class MyApp extends StatelessWidget {
  const MyApp({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return MaterialApp(
      debugShowCheckedModeBanner: false,
      //title: 'Flutter App',
      theme: ThemeData(primaryColor: Colors.blue),
      initialRoute: '/',
      //home: MyHomePage(),
      routes: {
        '/': (context) => MyHomePage(),
        '/x1': (context) => Screen1(),
        '/x2': (context) => Screen2(),
      },
    );
  }
}

class MyHomePage extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        //backgroundColor: Colors.orange,
        title: const Text(
          'Main Screen',
          style: TextStyle(color: Colors.black),
        ),
      ),
      body: Center(),
      drawerScrimColor: Colors.pinkAccent.withOpacity(0.5),
      drawer: MyDrawer(),
    );
  }
}
