//!هذا درس من دورة فلاتر ل حسن فليح بعنوان Pop
//!هذا الملف هو نفسه ممكن ان نعتبره ملف الماين اذا اردنا تنفيذ هذا التطبيق
//!نعدل فقط اسم الملف ونسميه main
//!هذا الملف سوف يكون مرتبط بالسكرين 1 والسكرين 2 والدراور ملفات رقم 39

import 'package:flutter/material.dart';
import '39.Drawer.dart';
import '39.Screen1.dart';
import '39.Screen2.dart';

//هذا الدرس هو نفس التطبيق اللي عملناه في الملفات السابقة رقم 38
//بما ان الدراور يحتوي على دالة سيلكت سكرين اذا انا لست بحاجة
// الى دوال سلكت سكرين بداخل سكرين1 وسكرين2 لذلك سوف احذفهم
// انا اصلا استخدمهم في ويدجت اينك ويل لذلك انا لست بحاجة الى نص
// في البودي ينقلني الى سكرين اخرى مادام موجود عندي دراور
// لذلك سوف احذف كل محتويات البودي في سكرين1 وسكرين2
//سوف الغي الدراور في السكرين1
//الان اريد اعدل في الدالة سيلكت اسكرين في ملف الدراور بحيث انه يظهر لي زر
//الرجوع عندما انتقل الى سكرين1 ولكن عند الانتقال الى سكرين2 لايظهر لي زر رجوع
//هذا يعني انني سوف استخدم مع السكرين1 Navigator.of(ctx).pushNamed(
//لان بوش نيمد يظهر لي زر الرجوع بينما في حالة سكرين2 وماين سكرين سوف استخدم
// Navigator.of(ctx).pushReplacementNamed(
//لان بوش ريبليسد نيمد لايظهر زر الرجوع
//وبالتالي فانني سوف اعمل اف ايلس استيتمنت بحيث انه لما تكون قيمة ال ان
//تساوي واحد استخدم Navigator.of(ctx).pushNamed(
//واجعله ينقلني مباشرة الى سكرين1 يعني '/x1'
//ولما تكون قيمة ال ان صفر او واحد سوف استخدم Navigator.of(ctx).pushReplacementNamed(
//واجعله ينقلني الى اما سكرين2 او ماين سكرين يعني '/' : '/x2'
//الان بعدما نستخدم بوش نيمد في نهاية دالة النافيقيتور ممكن ان نستخدم الدالة
//الدالة ذن وهي نفسها اللي نستعملها مع الفيوتشر .then((value)=> null)
//هي هاير اوردر فنكشن لذلك تستقبل دالة كاملة بداخلها
//طيب ايش نستفيد منها هنا
//نحنا لما ننتقل الى سكرين1 عبر بوش نيمد فاننا نستطيع الرجوع بزر الرجوع في الاعلى
// وعند رجوعنا الى الصفحة الرئيسية لو فتحنا التيرمنال في الاسفل نلاحظ انه يعطينا نل
// اي ان القيمة الراجعة لما رجع من سكرين1 الى الصفحة الرئيسية هي نل
// هذا يعني انه ممكن ان يرجع معلومات من الصفحة سكرين1 عند الرجوع
// 1اذا ممكن نستفيد من الدالة ذن في التقاط القيمة او البيانات الراجعة من سكرين
//ومن ثم وضعها في المتغير فاليو في الدالة ذن ومن ثم معالجتها او طباعتها
//الان نريد ان نرجع قيمة من سكرين1 ونلتقطها بواسطة الدالة ذن
//لذلك في سكرين1 سوف نعمل زر فلوتين اكشن بوتون عند الضغط عليها
// يتم اغلاق الصفحة ويرجعني الى النافذة السابقة ويقوم بارجاع قيمة معينة
//!اذا ماهي الدالة المسؤولة عن الحذف هي الدالة pop
//نستخدم هذي الدالة في بودي اون برسد
//يوجد عدة دوال لل بوب ومنها بوب اند بوش نيمد هذي عملها انها
// لما تحذف الصفحة تعمل لك بوش اي تنقلك الى صفحة اخرى من اختيارك
// وتضع رابط الصفحة وهنا جعلناه ينقلنا الى الصفحة الرئيسية '/'
// Navigator.of(context).popAndPushNamed('/');
//اما الدالة كان بوب فانها ترجع بوليان يعني هل استطيع الحذف
// تسمح لنا ان نتاكد مما اذا كان يمكننا حذف الصفحة او لا
//لكن متى لا استطيع الحذف اذا كان وصلت الى سكرين
//1 عن طريق الدالة بوش ريبليس منت فانه لا استطيع الحذف
// Navigator.of(context).canPop();
//الان نحن سوف نستخدم الدالة بوب العادية لاننا متاكدين اننا نستطيع الحذف
// لاننا وصلنا الى سكرين1 عن طريق بوش نيمد
// Navigator.of(context).pop();
//الان وفي اثناء الحذف سوف امرر قيمة متغير معين عملته للتجربة فقط
// var name = 'Mohammed';
//ممكن نمر اي شي استرينق انتجر مصفوفةاي شي
// Navigator.of(context).pop(name);
//الان عند تشغيل البرنامج والضغط على زر الفلوتن اكشن بوتن سوف يحذف الصفحة سكرين1
// ويمرر قيمة سوف نلتقطها بواسطة الدالة ذن وسوف يتم طباعتها في التيرمينال
//وممكن ان استفيد من القيمة المستقبلة باي طريقة كان اعمل متغير اسمه اس تي ار
// مثلا ونوعه استرينق وبدل ان اجعل الدالة ذن تطبع القيمة الملتقطة
// سوف اجعلها تسند هذي القيمة للمتغير str
// .then((value) => str = value as String);
//
//

void main() {
  runApp(const MyApp());
}

class MyApp extends StatelessWidget {
  const MyApp({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return MaterialApp(
      debugShowCheckedModeBanner: false,
      //title: 'Flutter App',
      theme: ThemeData(primaryColor: Colors.blue),
      initialRoute: '/',
      //home: MyHomePage(),
      routes: {
        '/': (context) => MyHomePage(),
        '/x1': (context) => Screen1(),
        '/x2': (context) => Screen2(),
      },
    );
  }
}

class MyHomePage extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        //backgroundColor: Colors.orange,
        title: const Text(
          'Main Screen',
          style: TextStyle(color: Colors.black),
        ),
      ),
      body: Center(),
      drawerScrimColor: Colors.pinkAccent.withOpacity(0.5),
      drawer: MyDrawer(),
    );
  }
}
