//!الشرح يبدا من ملف الماين 
//! 43.QuizApp_main_1.dart
//!هذا شرح الدروس من Quiz App 1 الى Quiz App 4
//!اما الدرس الخامس شرحه في الملفات رقم 44 Quiz App 5

//لما نقلنا الكونتينر من ملف الماين الى هنا طلع لنا خطاء في اسم اللستة كوسشن
//لانها معرفة في ملف الماين وليس هنا لذلك اما ان نستورد ملف الماين هنا
//او ان ننقل اللستة كلها هنا لكننا سوف نحتاجها في ملف الماين
//لذلك الحل الافضل هو اننا نمررها عن طريق الكونستركتر
//لذلك نعمل ننشى متغير هنا نوعه استرينق في هذا الكلاس ونعطيه اي اسم وننشئ كونستركتر
//من هذا الكلاس ونعرف بارامتير بداخله هو المتغير اللذي انشأناه هنا
//حتى اذا استدعينا كونستركتر هذا الكلاس في ملف الدالة ماين نمرر له لستة الاسئلة
//هذي الطريقة سوف نستخدمها في كل كلاسات الملفات الاخرى اذا اردنا ان نستدعي
// اي شي من ملف اخر
/*
class Question extends StatelessWidget {
  final String questionText;
  Question(this.questionText);

*/
//الان نضيف المتغير questionText;
//مكان اللستة كوسشن في العمود
//الان مجرد اننا نعمل اوبجكت من الكلاس كويز باقواس الكونستركتر في ملف ماين Question();
//ونمرر له عنصر نوعه استرينق وبالتالي سوف يتم خزن هذي القيمة في المتغير كوسشن تكست
//ويتم عرضها في التكست
//!الان بما اننا فصلنا الاسئلة في كونتينر في هذا الملف لحالها اذا لاداعي للعمود
//! الذي عملناه بداخل الكونتينر لان عندنا اسئلة فقط هنا وليس عندنا عناصر اخرى
//! لذلك سوف نحذف العمود ونضيف محتويات التكست مباشرة في الكونتينر
//!لاننا اصلا سوف نضيف العمود في ملف الماين
//!قبل الحذف
/*
Container(
          width: double.infinity, //نجعل الكونتينر بعرض الكامل الشاشة
          margin: EdgeInsets.all(10.0), //لكي يبعد عن حافة الصفحة
          child: Column(
            children: [
              Text(
                questionText,
                style: TextStyle(fontSize: 30),
                textAlign: TextAlign.center,
              ),
            ],
          ),
        ),;
*/

//بعد الحذف نفس اللي في الاسفل
//الان كل ماعلينا اذا اردنا الاسئلة ان نستخدم اوبجكت من هذا الكلاس الجاهز في اي ملف اخر
//
//
//
//

import 'package:flutter/material.dart';

class Question extends StatelessWidget {
  final String questionText;
  Question(this.questionText);

  @override
  Widget build(BuildContext context) {
    return Container(
      width: double.infinity, //نجعل الكونتينر بعرض الكامل الشاشة
      margin: EdgeInsets.all(10.0), //لكي يبعد عن حافة الصفحة
      child: Text(
        questionText,
        style: TextStyle(fontSize: 30),
        textAlign: TextAlign.center,
      ),
    );
  }
}
