//!الشرح يبدا من ملف الماين 
//! 43.QuizApp_main_1.dart
//!هذا شرح الدروس من Quiz App 1 الى Quiz App 4
//!اما الدرس الخامس شرحه في الملفات رقم 44 Quiz App 5

//الان كل ماعلينا بعد ان نقلنا الويدجت سنتر من الملف ماين الى هنا هو ان نستدعي
//كونستركتر هذا الكلاس في ملف الماين باقواس فارغة لاننا لانريد تمرير قيم لاي متغيرات
//الان سوف اضيف للويدجت سنتر عمود لكي اضيف له زر في لستة التشيلدرن
//هذا الزر عند الضغط عليه يعيد تنفيذ البرنامج من جديد يعني يرجعنا للصفحة الاولى
//سوف نعمل زر خفيف عبارة عن نص ممكن الضغط عليه وهو مايسمى تكست بوتون
//الان عند الضغط ابغاه يرجع الى السؤال الاول كيف احقق ذلك عن طريق اعطاء المتغير
//كوسشن اندكس القيمة صفر حتى يرجع الى اندكس السؤال الاول
//الان كيف اعمل هذا والباراميتر اون برسد حق الزر يحتاج ان امرر له دالة كاملة
//وايضا المتغير كوسشن اندكس اصلا موجود في الملف ماين وغير موجود هنا
//لذلك سوف انشى دالة في الملف ماين واجعلها فقط تعطي المتغير كوسشن اندكس القيمة صفر
//ومن ثم سوف انشئ هنا كونستركتر من هذا الكلاس وامرر فيه باراميتر عبارة عن دالة
//واقوم بتمرير الدالة التي عملتها في الملف ماين في الاوبجكت ريسلت حتى استقبلها هنا
//واضعها في الباراميتر اون برسد الدالة سميناها كيو q
//
//
//
//
//

import 'package:flutter/material.dart';

class Result extends StatelessWidget {
  final Function() q;

  //هذا عبارة عن كونستركتر الكلاس ريسولت
  Result(this.q);

  @override
  Widget build(BuildContext context) {
    return Center(
      child: Column(
        children: [
          Text(
            'Done !',
            style: TextStyle(fontSize: 45, fontWeight: FontWeight.bold),
          ),
          TextButton(
              onPressed: q,
              child: Text(
                'Restart The App',
                style: TextStyle(color: Colors.blue, fontSize: 30),
              ))
        ],
      ),
    );
  }
}
