//!
//عندما عرفنا الدالة انسر كوسشن في الدروس السابقة عرفناها بدون باراميترات
//لكن بما اننا هنا في الدرس الخامس اضفنا لها باراميتر في الملف ماين اذا هنا
//يجب ان نضيف باراميتر لها هنا علشان مايعطينا خطا عندما نمررها
// في اوبجكت الكلاس كويز في الملف ماين
// final Function(int s) answerQuestion;
//الان يجب ايضا ان نعدل على لستة الاجوبة التي في لستة التشلدرن حق العمود والتي
//نفذنا الدالة ماب عليها لانه اول كان متغير الدالة ماب يمر على جميع عناصر اللستة
// انسرس لكن الان نحن عقدنا اللستة انسرس ومعاد صارت تحتوي على لستة اوف استرينق
// وانما صارت تحتوي على لستة اوف ماب وبالتالي يجب ان نحدد مكان الجواب بالضبط
// الذي نريد المتغير حق الدالة ماب ان يمر عليه وهو بداخل اللستة انسرس
// عند استدعاء المفتاح تكست يعطينا القيمة
// وهي الجواب المطلوب الذي نريد متغير الدالة ماب ان يمر عليه
//لكن وبدلا عن ذلك بامكاننا ان نجعل المتغير حق الدالة ماب يمر على العناصر عادي
// زي اول لكن هنا الان سوف يمر على عناصر اللستة انسرس وهي عبارة عن ماب
// اي ان متغير الدالة ماب سوف يمر في كل مرة على عنصر عبارة عن ماب
// ويوجد به مفتاحين ونحنا اصلا نريد المفتاح تكست الذي يوجد به القيمة وهي الجواب
// الذي نريده اذا وببساطة سوف نمرر متغير الدالة ماب وناخذ منه فقط المفتاح تكست كالتالي
// return Answer(answerQuestion, answer['text'].toString());
//لا ننسى ان نحوله الى استرينق حتى لايعطينا خطا .toString()
//ايضا يجب ان نعدل نوع اللستة التي نفذنا عليها الدالة ماب اول كانت نوعها
// استرينق لكن الان سوف يكون نوعها لست اوف ماب اوف استرينق واوبجكت
// List<Map<String, Object>>
//الان طيب لو اريد قيمة الدرجات ببساطة نكتب
// return Answer(answerQuestion, answer['score']);
//الان طيب اريد الحصول على الاجابة مثل ما عملمنا في الاعلى واريد اضا الحصول على الدرجات اسكور
//الجواب سوف نحصل عليه مثلما قلنا من خلال answer['text']
//لكن الاسكور الدرجات هي اصلا مجموعها موجود بداخل الدالة انسركوسشن answerQuestion
//بالتالي انا اصلا امررها في كونستركتر الكلاس انسر هنا
// Answer(answerQuestion, answer['text'].toString());
//الان اذا اردت استدعاء الاسكور من الدالة انسر كوسشن من نفس الدالة في الملف ماين
//يجب هنا ان اقوم بتنفيذ الدالة انسركوسشن وليس تمريرها فقط ولكي انفذها
//يجب ان يكون التنفيذ في بودي دالة اي انني سوف اعمل دالة انونمس وانفذ الدالة
//انسر كوسشن بداخلها اي سوف استدعيها مع اقواسها وامرر لها ارقيومنت
// لانها يوجد بها باراميتر هو الاسكور هذا الباراميتر الاسكور اريد ان امرر له
//الدرجات لكي اجمعها في المتغير توتال سكور في الدالة انسركوسشن بالتالي هنا سوف
// امرر له الاسكور الذي سوف احصل عليه بواسطة الدالة ماب وهو كما قلنا في الاعلى
// answer['score']
//وبهكذا يكون شكل الدالة
// Answer(()=> answerQuestion(answer['score']), answer['text'].toString());
//ولكي لايعطينا خطا فانه يجب اولا ان نحول الاسكور الى استرينق كما عملنا مع التكست
// ['score'].toString()
//ومن ثم نحوله كله الى انتجر عن طريق الدالة بارس وذلك لان الاسكور حق الدالة
//انسر كوسشن التي في ملف الماين حقها الباراميتر اسكور نوعه انتجر
// int.parse(['score'].toString())
//الان يكون الناتج النهائي هكذا
// return Answer(()=> answerQuestion(int.parse(['score'].toString())), answer['text'].toString());
//
//
//
//

import 'package:flutter/material.dart';
import '44.QuizApp_answer_2.dart';
import '44.QuizApp_question_2.dart';

class Quiz extends StatelessWidget {
  final List<Map<String, Object>> question;
  final int questionIndex;
  final Function(int s) answerQuestion;

  Quiz(this.question, this.questionIndex, this.answerQuestion);

  @override
  Widget build(BuildContext context) {
    return Column(
      children: <Widget>[
        Question(question[questionIndex]['questionText'].toString()),
        ...(question[questionIndex]['answers'] as List<Map<String, Object>>)
            .map((answer) {
          return Answer(() => answerQuestion(int.parse(['score'].toString())),
              answer['text'].toString());
        }).toList(),
      ],
    );
  }
}
