//!هذا درس من دورة فلاتر ل حسن فليح بعنوان Async / Await in Flutter
//!هذا الملف هو نفسه ممكن ان نعتبره ملف الماين اذا اردنا تنفيذ هذا التطبيق
//!نعدل فقط اسم الملف ونسميه main

//في هذا الدرس سوف نتعلم كيفية استخدام اسينك اويت في فلاتر
//!اولا ارجع الى درس اسينك اويت في دروس لغة دارت او الملخص الذي كتيته لهذا الدرس
//ثم بعد ذلك ارجع الى هذا الدرس
//الان لو اردنا استخدام القيم الراجعة من الفيوتشر او الستريم ونريد عرضها في
//تايتل الاب بار
//الان سوف انشى دالة اسمها قت داتا وسوف اعرف بداخلها استريم وسوف اعمل له ارجاع
//الارجاع من نوع استريم اوف انتجر Stream<int> getData() {
//ثم عملنا زر الفيتد بوتون بحيث انه عند الضغط على هذا الزر ينفذ الدالة قت داتا
//وبالتالي ترجع لنا هذي الدالة استريم يقوم كل ثانيتين بارجاع انتجر
//الان نريد عرض هذا الاستريم في تايتل الاب بار وبما ان الارجاع عبارة عن استريم
//يجب ان نحوله الى ليست اوف انتجر لكي استطيع التعامل معه بالتالي سوف استخدم
//اسينك اويت حتى انتظر ثم يكون الناتج ليست اوف انتجر
//الان استطيع التعامل مع الاستريم كانه ليست اوف انتجر بدون ان يعطينا خطأ
//وبما انها ليست اذا احتاج الى لوب لكي امر على جميع القيم
// onPressed: () async{await for(final item in getData())}
//الان عند الضغط على الزر فانه يستدعي الدالة قت داتا والقيمة الراجعة منها
//يدخلها في فور لوب ونمرر فيها المتغير ايتم الان صارت جميع قيم الاستريم في المتغير ايتم
//الان نستطيع استخدم القيم الانتجر المخزنة في المتغير ايتم ونعرضها في التايتل
//لكن قبل كل شي نعرف اولا متغير اي خارج الدالة بيلد ونعطيه قيمة صفر
//ونمرر قيمة ال اي في التايتل حتى نهيئه لاستقبال قيم ال ايتم من الباراميتر اون برسد
//لان المتغير ايتم هو اصلا بدخل دالة الباراميتر اون برسد بالتالي
//لا استطيع تمريره في التايتل لانه سوف يعطينا خطا انه غير معرف
//الان الخطوة الثانية بما ان المتغير ايتم بداخل دالة الاون برسد تتغير قيمته كل مره
// يعني ان حالته تتغير كل مره اذا لابد من ادخاله في دالة ست استيت
//وسوف اقوم باسناد قيمة الاستم الى المتغير اي داخل الدالة ست استيت
//وبالتالي يتم عرض قيم الاستريم في التايتل
/*
onPressed: () async {
                  await for (final item in getData()) {
                    setState(() {
                      i = item;
                    });
                  }
                }
*/
//الان عند تشغيل التطبيق نلاحظ ان الاعداد الانتجر يتم عرضها في تايتل الاب بار
//ولكنها تستمر الى مالانهاية لذلك يجب ان نضع شرط لكي نوقف الاستريم
//سوف نوقف الاستريم عندما يضل الى العدد 10
/*
onPressed: () async {
                  await for (final item in getData()) {
                    setState(() {
                      i = (item<10? item:0);
                    });
                  }
                }
*/
//اذا كانت قيمة الايتم اصغر من 10 اذا اعطينا قيمة الايتم واذا لا اطبع صفر فقط
//
//

import 'package:flutter/material.dart';

main() {
  runApp(MyApp());
}

class MyApp extends StatefulWidget {
  @override
  State<MyApp> createState() => _MyAppState();
}

class _MyAppState extends State<MyApp> {
  Stream<int> getData() {
    Stream<int> myStream = Stream.periodic(Duration(seconds: 2), (a) => a);
    return myStream;

    /*await for (final value in myStream) {
      if (value > 10) break;
      print(value);
    }
    */
  }

  int i = 0; //هذا المتغير سوف امرره للتايتل حق الاب بار واعرض قيمته

  @override
  Widget build(BuildContext context) {
    return Scaffold(
        appBar: AppBar(title: Text('$i')),
        body: Center(
            child: ElevatedButton(
                child: Text('click me !'),
                onPressed: () async {
                  await for (final item in getData()) {
                    setState(() {
                      i = (item < 10 ? item : 0);
                    });
                  }
                })));
  }
}
