//!هذا درس من دورة فلاتر ل حسن فليح بعنوان Colors
//!الان في جميع الدروس القادمة سوف نجعل ملف خاص للدالة main
//!نستدعي بداخلها الدالة رن اب ثم سوف نمرر بداخل هذي الدالة اي درس نشرحه

import 'package:flutter/material.dart';

//الكونتينر اذا مررنا لها المتغير كولور فقط واعطيناه قيمة للون معين
//فان اللون سوف يطبق على كامل الصفحة اما اذا مثلا اضفنا للكونتينر تشايلد
// ومررنا له تكست فان اللون سوف يحيط بالتكست فقط كما الذي عملناه هنا
//المتغير كولور ممكن ان نمرر له Color.from
//!نلاحظ انه يعطينا نظامين للالوان RGB
//لو اخترنا احد النظامين مثلا Color.fromRGBO(r, g, b, opacity)
//فاننا نمرر قيم للباراميترات الاحمر والاخضر والاسود والشفافية
//اذا اردنا ان نشبع لون معين نعطيه قيمة 255 والالوان الاخرى نعطيها قيمة صفر
//اما الشفافية اذا عطيناها رقم 1 فانه يشبع اللون واذا صفر يزيل اللون
//واي درجة بين الصفر والواحد يعطينا شفافية مختلفة
//بهذا النظام فاننا نستطيع جلب اي لون نريده
//لكي نختار اي لون نريده نذهب الى قوقل ونبحث عن color picker
//ونختار اللون وسوف يعطينا قيم هذا اللون لكي نضعها في ال RGB
//اما النظام الثاني هو Color.fromARGB(a, r, g, b)
//هذا النظام يمثل فيه الحرف ايه الشفافية الاوباسيتي والباقي نفسه
//الاختلاف بينهما انه هنا في نظام ARGB
//نعطي الحرف ايه قيمة للشفافية من صفر الى 255
//الاشباع 255 ومسح اللون هو 0
//في النظامين اذا اعطينا جميع الالوان اشباع كامل 255 الناتج اللون الابيض
//واذا اعطينا صفر لكل الالوان فانه يعطينا اللون الاسود
//!فيه نظام اخر هو الهيكسا السادس عشر ونصل اليه من خلال الكونستركتر Colors()
//نمرر بين اقواس هذا الكونستركتر قيمة هيكساسستم للون معين
//لكي نختار اي لون نريده نذهب الى قوقل ونبحث عن color picker

class LessonOne extends StatelessWidget {
  const LessonOne({Key? key}) : super(key: key);
  //هذا الكي المفتاح سوف يتم شرحه في دروس لاحقه

  @override
  Widget build(BuildContext context) {
    return MaterialApp(
      debugShowCheckedModeBanner: false,
      home: Scaffold(
        body: Container(
          //الكونتينر هو وعاء يحتوي مجموعة من الويدجت
          //child: const Text('Hello World'),
          //color: Colors.blueAccent,
          //color:const Color.fromRGBO(255, 0, 0, 1), //هذا يعطينا اللون الاحمر فقط
          //color: const Color.fromRGBO(0, 255, 0, 1),//هذا يعطينا اللون الاخضر فقط
          //color: const Color.fromRGBO(200, 10, 170, 0.6),//هذا يعطينا لون اخر
          //const Color.fromARGB(255, 255, 0, 0), //هنا يعطينا اللون الاحمر باشباع كامل
          color: const Color(0xFFFFFFFF), //هذي قيمة اللون الابيض
        ),
        appBar: AppBar(
          backgroundColor: Colors.orange,
          title: const Text('Home page'),
          leading: Icon(
            Icons.access_alarm_rounded,
            //color: Colors.red,//اذا اردنا درجات من هذا اللون نروح الى اكواده
            color: Colors.red[700], //هنا اخترنا احدى درجات اللون الاحمر
          ),
        ),
      ),
    );
  }
}
