//!هذا درس من دورة فلاتر ل حسن فليح بعنوان URL Launcher
//!هذا الملف هو نفسه ممكن ان نعتبره ملف الماين اذا اردنا تنفيذ هذا التطبيق
//!نعدل فقط اسم الملف ونسميه main

//هذا الدرس هو تطبيق على الدروس السابقة فيوتشر استريم اسينك اويت
// بحيث اننا سوف نعمل زر في وسط الصفحة بحيث انه عند الضغط على هذا الزر
// يستدعي رابط معين وينقلنا اليه عرفنا متغير اسمه يو ار ال واسندنا اليه رابط
//تطبيق فيس بوك لايت على متجر قوقل بلاي
//اولا نحتاح الى تنصيب مكتبة url launcher
//نكتب في قوقل url launcher flutter
//وننصبها في الدبندنسيس في ملف بب اسبك دوت يامل
//ننسخ رابط الدبندنسيس ونلصقه في ملف بب اسبك ورابط الامبورت ونلصقه هنا
//يوجد نوعين من الدبندنسيس dependencies: و dev_dependencies:
//الفرق بينهم هو ان البكج الذي نضعه في ديف دبندنسيس يكون بكج للتطوير فقط
// يستخدمه هنا بداخل الفيجوال استوديو فقط ولا ينقله فيما بعد للتطبيق النهائي
//عندما نحوله الى ملف مستقل
//بعكس البكج الذي نضعه بداخل دبندنسيس فانه يدمجه بداخل التطبيق النهائي
// الذي نعطيه المستخدم لذلك يجب الانتباه اين نضع البكجات
//الان لو نفتح البكج التي نصبناها سوف نلاحظ ان اهم دالة فيها هي دالة اللنش launch
//هذي الدالة تستخدم لتشغيل الرابط او نقلي الى هذا الرابط
//ممكن ان نمرر الدالة لنش مباشرة بداخل بودي دالة الاون برسد ونمرر لها المتغير
//يو ار ال وعند تشغيل التطبيق عند الضغط على الزر ينقلنا مباشرة
// الى تطبيق فيس بوك لايت في قوقل بلاي
// onPressed: (){launch(url);}
//لكن هذا غلط لانه اذا نضرنا الى نوع ارجاع الدالة لنش سوف نلاحظ انه فيوتشر اوف بوليان
// Future<bool> launch()
//اي انه المفروض اننا ننتظر القيمة منه وليس نطلبها مباشرة كما علمنا في الاعلى
//بالتالي فان المفروض والصحيح اننا نحول الدالة التي مررنا له الدالة لنش الى
//نحولها الى اسينكرونس فنكشن اي نضيف لها اسينك اويت
// onPressed: () async{ await launch(url);}
//الان جعلناها قابلة للانتظار
//السبب اننا جعلناها قابلة للانتظار انه اذا كان النت مثلا ضعيف عند المستخدم
// فالمفروض انه لاتحجب واجهة المستخدم الى حين الانتقال الى الرابط
// وانما يضل المستخدم يستطيع تصفح التطبيق والى حين الانتهاء من جلب الرابط
//هذا البكج يوفر لنا دالة اخرى هي كان لنش canLunch
//
//
//
//
//

import 'package:flutter/material.dart';
import 'package:url_launcher/url_launcher.dart';

main() {
  runApp(MyApp());
}

class MyApp extends StatefulWidget {
  @override
  State<MyApp> createState() => _MyAppState();
}

class _MyAppState extends State<MyApp> {
  String str = 'Get The App';

  //رابط تطبيق فيس بوك لايت على قوقل بلاي
  var url = 'https://play.google.com/store/apps/details?id=com.facebook.lite';

  //رابط فيديو على اليوتيوب
  //var url ='https://www.youtube.com/watch?v=Cy4G_aE6e1M';

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(title: Text('Demo !')),
      body: Center(
        child: ElevatedButton(
            child: Text('Get The App'),
            onPressed: () {
              launch(url);
            }),
      ),
    );
  }
}
